In [1]:
# Week #2 Assignment Notebook.  
# Student: Gary Gee
#
# For this notebook, I will attempt to demonstrate the following things that are required in the assignment.
#
# 1) Assign variables
# 2) Perform built in comparison and mathematical functions
# 3) Use several native Python functions (e.g., range(), help() )
# 4) Loop over a list and print to the console
# 5) Import Pandas
# 6) Create a dataframe with a few columns and rows.
# 7) Index a pandas data frame and print different cells, rows, columns, etc.

In [2]:
# 1) Assign Variables
#
# I will set two variables 'g', 'a'and 'p' to be some numbers and also a string to variable called 'message'

g = 2017
a =  101
p = 2017
message = 'Hello World! My very first few lines of python code!'
SumTotal=g+a+p

# Print output of these variables
print 'Values of variables (a, g, p and message) are:'
print 'g='+str(g)+', a='+str(a)+', p='+str(p), 'and message="'+message+'"'
print 'Total of g+a+p =',SumTotal

Values of variables (a, g, p and message) are:
g=2017, a=101, p=2017 and message="Hello World! My very first few lines of python code!"
Total of g+a+p = 4135

In [3]:
# 2) Perform built in comparison and mathematical operations/functions
# 
# In this part of the notebook... I will use the above variables

# iS g (which has a value of 2017) > a (which has a value of 101)  - the result should be True 

g > a

True

In [4]:
# g<a  -the result should be False (as 2017 is not greater than 101)
g < a

False

In [5]:
# will use cmp function as 'a' is larger than 'g' we should get -1 as result
cmp(g,a)

1

In [6]:
# g == a (is the value of 'g' equal to 'a')  - the result should be False (as 2017 is not the same as  101)
g==a

False

In [7]:
# check to see if g is not equal to a (ie !=)  answer should be true as value of g (2017) is not same as a (101)
#g!=a
g!=a

True

In [8]:
# is variable 'g' of equal value to variable 'p'  - the result will be True as both variables have value of 2017
g==p

True

In [9]:
# will use cmp function as 'g' is the same as  'p' we should get 0 as result
cmp(g,p)

0

In [10]:
# I will use some mathematical functions with variables.
#  Set variable 'a' to be the total sum of 'g' (2017) and 'p' (2017) which is 4034
a=g+p
a

4034

In [11]:
# Divide variable g by 2.
# g/2

g/2

1008

In [12]:
# perform multiplication with two numbers
# 200 * 15.6
200*15.6

3120.0

In [13]:
# Perform division with 2 numbers
#109/2.0
109/2.0

54.5

In [14]:
# use the round function with this result.  Should get 55.0
round(54.5)

55.0

In [15]:
# Use exponent **
# Calculate 2 to tbe power of 10 
# 2**10  (answer should be 1024)
2**10

1024

In [16]:
pow(2,10)  # I will use the power function for the same as above.

1024

In [17]:
# get absolute values
# absolute value of -123 is 123
abs(-123)

123

In [18]:
# get absolute values
# absolute value of 113 is still 113
# I will assign it to variable 'y'
y=abs(113)
y

113

In [19]:
# use round formula on PI approximation to 5 decimal places.
round((22/7.0),5)

3.14286

In [20]:
# Turn g into a floating point value from it's value of 2017 we 
# will get a result of 2017.0
float(g)

2017.0

In [21]:
# 3) Use several native Python functions (e.g., range(), help() )
# I will use the python functions:
# print(), max(), range() and help()

In [22]:
# Usage of print() function
print('This is a test!!!  Testing 1,2,3.')

This is a test!!!  Testing 1,2,3.

In [23]:
# max() - to get max value of a set of arguments (numbers in this case)
max(100,20,21,22,100.4)

100.4

In [24]:
# range() - I will have python count the numbers from 1 to 10 via the 
# range function
range(1,11)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [25]:
# range() - I will have python count the numbers from 1 to 10 (skipping ever other number
# via the range function
range(1,11,2)

[1, 3, 5, 7, 9]

In [26]:
# help() function... I will output 'help' on the print function.
# help('print')
help('print')

The "print" statement
*********************

   print_stmt ::= "print" ([expression ("," expression)* [","]]
                  | ">>" expression [("," expression)+ [","]])

"print" evaluates each expression in turn and writes the resulting
object to standard output (see below).  If an object is not a string,
it is first converted to a string using the rules for string
conversions.  The (resulting or original) string is then written.  A
space is written before each object is (converted and) written, unless
the output system believes it is positioned at the beginning of a
line.  This is the case (1) when no characters have yet been written
to standard output, (2) when the last character written to standard
output is a whitespace character except "' '", or (3) when the last
write operation on standard output was not a "print" statement. (In
some cases it may be functional to write an empty string to standard
output for this reason.)

Note: Objects which act like file objects but which are not the
  built-in file objects often do not properly emulate this aspect of
  the file object's behavior, so it is best not to rely on this.

A "'\n'" character is written at the end, unless the "print" statement
ends with a comma.  This is the only action if the statement contains
just the keyword "print".

Standard output is defined as the file object named "stdout" in the
built-in module "sys".  If no such object exists, or if it does not
have a "write()" method, a "RuntimeError" exception is raised.

"print" also has an extended form, defined by the second portion of
the syntax described above. This form is sometimes referred to as
""print" chevron." In this form, the first expression after the ">>"
must evaluate to a "file-like" object, specifically an object that has
a "write()" method as described above.  With this extended form, the
subsequent expressions are printed to this file object.  If the first
expression evaluates to "None", then "sys.stdout" is used as the file
for output.

In [27]:
# help() function... I will output 'help' on the comparison operation '=='.
# help('==')
help('==')

Comparisons
***********

Unlike C, all comparison operations in Python have the same priority,
which is lower than that of any arithmetic, shifting or bitwise
operation.  Also unlike C, expressions like "a < b < c" have the
interpretation that is conventional in mathematics:

   comparison    ::= or_expr ( comp_operator or_expr )*
   comp_operator ::= "<" | ">" | "==" | ">=" | "<=" | "<>" | "!="
                     | "is" ["not"] | ["not"] "in"

Comparisons yield boolean values: "True" or "False".

Comparisons can be chained arbitrarily, e.g., "x < y <= z" is
equivalent to "x < y and y <= z", except that "y" is evaluated only
once (but in both cases "z" is not evaluated at all when "x < y" is
found to be false).

Formally, if *a*, *b*, *c*, ..., *y*, *z* are expressions and *op1*,
*op2*, ..., *opN* are comparison operators, then "a op1 b op2 c ... y
opN z" is equivalent to "a op1 b and b op2 c and ... y opN z", except
that each expression is evaluated at most once.

Note that "a op1 b op2 c" doesn't imply any kind of comparison between
*a* and *c*, so that, e.g., "x < y > z" is perfectly legal (though
perhaps not pretty).

The forms "<>" and "!=" are equivalent; for consistency with C, "!="
is preferred; where "!=" is mentioned below "<>" is also accepted.
The "<>" spelling is considered obsolescent.


Value comparisons
=================

The operators "<", ">", "==", ">=", "<=", and "!=" compare the values
of two objects.  The objects do not need to have the same type.

Chapter Objects, values and types states that objects have a value (in
addition to type and identity).  The value of an object is a rather
abstract notion in Python: For example, there is no canonical access
method for an object's value.  Also, there is no requirement that the
value of an object should be constructed in a particular way, e.g.
comprised of all its data attributes. Comparison operators implement a
particular notion of what the value of an object is.  One can think of
them as defining the value of an object indirectly, by means of their
comparison implementation.

Types can customize their comparison behavior by implementing a
"__cmp__()" method or *rich comparison methods* like "__lt__()",
described in Basic customization.

The default behavior for equality comparison ("==" and "!=") is based
on the identity of the objects.  Hence, equality comparison of
instances with the same identity results in equality, and equality
comparison of instances with different identities results in
inequality.  A motivation for this default behavior is the desire that
all objects should be reflexive (i.e. "x is y" implies "x == y").

The default order comparison ("<", ">", "<=", and ">=") gives a
consistent but arbitrary order.

(This unusual definition of comparison was used to simplify the
definition of operations like sorting and the "in" and "not in"
operators. In the future, the comparison rules for objects of
different types are likely to change.)

The behavior of the default equality comparison, that instances with
different identities are always unequal, may be in contrast to what
types will need that have a sensible definition of object value and
value-based equality.  Such types will need to customize their
comparison behavior, and in fact, a number of built-in types have done
that.

The following list describes the comparison behavior of the most
important built-in types.

* Numbers of built-in numeric types (Numeric Types --- int, float,
  long, complex) and of the standard library types
  "fractions.Fraction" and "decimal.Decimal" can be compared within
  and across their types, with the restriction that complex numbers do
  not support order comparison.  Within the limits of the types
  involved, they compare mathematically (algorithmically) correct
  without loss of precision.

* Strings (instances of "str" or "unicode") compare
  lexicographically using the numeric equivalents (the result of the
  built-in function "ord()") of their characters. [4] When comparing
  an 8-bit string and a Unicode string, the 8-bit string is converted
  to Unicode.  If the conversion fails, the strings are considered
  unequal.

* Instances of "tuple" or "list" can be compared only within each of
  their types.  Equality comparison across these types results in
  unequality, and ordering comparison across these types gives an
  arbitrary order.

  These sequences compare lexicographically using comparison of
  corresponding elements, whereby reflexivity of the elements is
  enforced.

  In enforcing reflexivity of elements, the comparison of collections
  assumes that for a collection element "x", "x == x" is always true.
  Based on that assumption, element identity is compared first, and
  element comparison is performed only for distinct elements.  This
  approach yields the same result as a strict element comparison
  would, if the compared elements are reflexive.  For non-reflexive
  elements, the result is different than for strict element
  comparison.

  Lexicographical comparison between built-in collections works as
  follows:

  * For two collections to compare equal, they must be of the same
    type, have the same length, and each pair of corresponding
    elements must compare equal (for example, "[1,2] == (1,2)" is
    false because the type is not the same).

  * Collections are ordered the same as their first unequal elements
    (for example, "cmp([1,2,x], [1,2,y])" returns the same as
    "cmp(x,y)").  If a corresponding element does not exist, the
    shorter collection is ordered first (for example, "[1,2] <
    [1,2,3]" is true).

* Mappings (instances of "dict") compare equal if and only if they
  have equal *(key, value)* pairs. Equality comparison of the keys and
  values enforces reflexivity.

  Outcomes other than equality are resolved consistently, but are not
  otherwise defined. [5]

* Most other objects of built-in types compare unequal unless they
  are the same object; the choice whether one object is considered
  smaller or larger than another one is made arbitrarily but
  consistently within one execution of a program.

User-defined classes that customize their comparison behavior should
follow some consistency rules, if possible:

* Equality comparison should be reflexive. In other words, identical
  objects should compare equal:

     "x is y" implies "x == y"

* Comparison should be symmetric. In other words, the following
  expressions should have the same result:

     "x == y" and "y == x"

     "x != y" and "y != x"

     "x < y" and "y > x"

     "x <= y" and "y >= x"

* Comparison should be transitive. The following (non-exhaustive)
  examples illustrate that:

     "x > y and y > z" implies "x > z"

     "x < y and y <= z" implies "x < z"

* Inverse comparison should result in the boolean negation. In other
  words, the following expressions should have the same result:

     "x == y" and "not x != y"

     "x < y" and "not x >= y" (for total ordering)

     "x > y" and "not x <= y" (for total ordering)

  The last two expressions apply to totally ordered collections (e.g.
  to sequences, but not to sets or mappings). See also the
  "total_ordering()" decorator.

* The "hash()" result should be consistent with equality. Objects
  that are equal should either have the same hash value, or be marked
  as unhashable.

Python does not enforce these consistency rules.


Membership test operations
==========================

The operators "in" and "not in" test for membership.  "x in s"
evaluates to "True" if *x* is a member of *s*, and "False" otherwise.
"x not in s" returns the negation of "x in s".  All built-in sequences
and set types support this as well as dictionary, for which "in" tests
whether the dictionary has a given key. For container types such as
list, tuple, set, frozenset, dict, or collections.deque, the
expression "x in y" is equivalent to "any(x is e or x == e for e in
y)".

For the string and bytes types, "x in y" is "True" if and only if *x*
is a substring of *y*.  An equivalent test is "y.find(x) != -1".
Empty strings are always considered to be a substring of any other
string, so """ in "abc"" will return "True".

For user-defined classes which define the "__contains__()" method, "x
in y" returns "True" if "y.__contains__(x)" returns a true value, and
"False" otherwise.

For user-defined classes which do not define "__contains__()" but do
define "__iter__()", "x in y" is "True" if some value "z" with "x ==
z" is produced while iterating over "y".  If an exception is raised
during the iteration, it is as if "in" raised that exception.

Lastly, the old-style iteration protocol is tried: if a class defines
"__getitem__()", "x in y" is "True" if and only if there is a non-
negative integer index *i* such that "x == y[i]", and all lower
integer indices do not raise "IndexError" exception. (If any other
exception is raised, it is as if "in" raised that exception).

The operator "not in" is defined to have the inverse true value of
"in".


Identity comparisons
====================

The operators "is" and "is not" test for object identity: "x is y" is
true if and only if *x* and *y* are the same object.  "x is not y"
yields the inverse truth value. [6]

Related help topics: EXPRESSIONS, BASICMETHODS, OPERATORS

In [28]:
# 4) Loop over a list and print to the console
# For Loop
i=0
lista=[1,2,3,4,6,10]

for i in range(len(lista)):
    print lista[i]

1
2
3
4
6
10

In [29]:
# Do same thing with a While Loop
lista=[1,2,3,4,6,10]
i=0
while i < len(lista):
    print lista[i]
    i=i+1

1
2
3
4
6
10

In [30]:
# Do same thing with a break Loop
lista=[1,2,3,4,6,10]
i=0
for i in range(100):
    if i==len(lista):
        break     
    print lista[i]

1
2
3
4
6
10

In [31]:
# 5) Import Pandas
import pandas as pd  # read to import as 'pd' or some other name to avoid 
                     # overlap with other libraries with similar method names

In [32]:
# 6) Create a dataframe with a few columns and rows.
# set the source data set list up.
source_dataset = {'Company':['Facebook', 'Amazon', 'Netflix','Google'],
                  'Close':[179.59,1137.29,195.51,1048.47],
                  'High':[179.83,1138.16,197.70,1051.76],
                  'Low':[178.50,1130.05,193.75,1038.00],
                  'Volume':[15600000, 2210000,5680000,1190000]
        
                 }
# Create a dataframe called stocktable from the list if values in source_dataset
stocktable=pd.DataFrame(source_dataset)

# Output the stocktable
stocktable

     Close   Company     High      Low    Volume
0   179.59  Facebook   179.83   178.50  15600000
1  1137.29    Amazon  1138.16  1130.05   2210000
2   195.51   Netflix   197.70   193.75   5680000
3  1048.47    Google  1051.76  1038.00   1190000

In [33]:
# 7) Index a pandas data frame and print different cells, rows, columns, etc.

import pandas as pd 


# set the source data set list up
originaldata = {'Type':['Navel', 'Cara Cara', 'Mandarin','Kumquat','Cara Cara','Navel','Navel','Cara Cara'],
                  'Price':[1.59,2.79,2.99,3.99,2.99,1.79,.99,1.99],
                  'Store':['Metro','Loblaws','Loblaws','Loblaws','Metro','Loblaws','No Frills','T&T'],
                  'Location':['Kennedy','Hwy 7','Carlton','St. Clair','College Park','Queen-Portland','Agincourt','Warden']}
df=pd.DataFrame(originaldata, columns = ['Type', 'Price', 'Store','Location'])
df

        Type  Price      Store        Location
0      Navel   1.59      Metro         Kennedy
1  Cara Cara   2.79    Loblaws           Hwy 7
2   Mandarin   2.99    Loblaws         Carlton
3    Kumquat   3.99    Loblaws       St. Clair
4  Cara Cara   2.99      Metro    College Park
5      Navel   1.79    Loblaws  Queen-Portland
6      Navel   0.99  No Frills       Agincourt
7  Cara Cara   1.99        T&T          Warden

In [34]:
FruitTable=df.set_index('Location')
# output the original table that all of the next python statements will be 
# based on the original table.

print('Original Table')

FruitTable

Original Table

                     Type  Price      Store
Location
Kennedy             Navel   1.59      Metro
Hwy 7           Cara Cara   2.79    Loblaws
Carlton          Mandarin   2.99    Loblaws
St. Clair         Kumquat   3.99    Loblaws
College Park    Cara Cara   2.99      Metro
Queen-Portland      Navel   1.79    Loblaws
Agincourt           Navel   0.99  No Frills
Warden          Cara Cara   1.99        T&T

In [35]:
# Following lines show the printing out of various table columns
FruitTable['Price']

Location
Kennedy           1.59
Hwy 7             2.79
Carlton           2.99
St. Clair         3.99
College Park      2.99
Queen-Portland    1.79
Agincourt         0.99
Warden            1.99
Name: Price, dtype: float64

In [36]:
FruitTable['Type']

Location
Kennedy               Navel
Hwy 7             Cara Cara
Carlton            Mandarin
St. Clair           Kumquat
College Park      Cara Cara
Queen-Portland        Navel
Agincourt             Navel
Warden            Cara Cara
Name: Type, dtype: object

In [37]:
FruitTable['Store']

Location
Kennedy               Metro
Hwy 7               Loblaws
Carlton             Loblaws
St. Clair           Loblaws
College Park          Metro
Queen-Portland      Loblaws
Agincourt         No Frills
Warden                  T&T
Name: Store, dtype: object

In [38]:
# Following lines show the printing out of various table rows
# Print out row for 'Hwy 7' store location using that index
FruitTable.loc['Hwy 7']

Type     Cara Cara
Price         2.79
Store      Loblaws
Name: Hwy 7, dtype: object

In [39]:
# Print out first 3 rows of table
FruitTable.iloc[:3]

               Type  Price    Store
Location
Kennedy       Navel   1.59    Metro
Hwy 7     Cara Cara   2.79  Loblaws
Carlton    Mandarin   2.99  Loblaws

In [40]:
# Print out rows where price is above $1.99 
FruitTable[FruitTable['Price']> 1.99]

                   Type  Price    Store
Location
Hwy 7         Cara Cara   2.79  Loblaws
Carlton        Mandarin   2.99  Loblaws
St. Clair       Kumquat   3.99  Loblaws
College Park  Cara Cara   2.99    Metro

In [41]:
# Print out rows for loblaws stores
FruitTable[ FruitTable['Store']=='Loblaws']

                     Type  Price    Store
Location
Hwy 7           Cara Cara   2.79  Loblaws
Carlton          Mandarin   2.99  Loblaws
St. Clair         Kumquat   3.99  Loblaws
Queen-Portland      Navel   1.79  Loblaws

In [42]:
# Print out rows for Navel oranges
FruitTable[ FruitTable['Type']=='Navel']

                 Type  Price      Store
Location
Kennedy         Navel   1.59      Metro
Queen-Portland  Navel   1.79    Loblaws
Agincourt       Navel   0.99  No Frills

In [43]:
# Outputting cells in the table
# Next... I will print out various cells in a given row of the table

In [44]:

FruitTable.iloc[1]  # print out row 1 (all cells) of 2nd line of original table

Type     Cara Cara
Price         2.79
Store      Loblaws
Name: Hwy 7, dtype: object

In [45]:
FruitTable.iloc[1,0] # print out 1st cell of row 1 (2nd line) of original table
                     # this will essentially output the type of orange

'Cara Cara'

In [46]:
FruitTable.iloc[1,1] # print out 2nd cell of row 1 (2nd line) of original table
                     # this will essentially output the price

2.79

In [47]:
FruitTable.iloc[1,2] # print out 3rd cell of row 1 (2nd line) of original table
                     # this will essentially output the store

'Loblaws'